In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Coumn4"])

In [3]:
df.head()

      Column1  Column2  Column3  Coumn4
Row1        0        1        2       3
Row2        4        5        6       7
Row3        8        9       10      11
Row4       12       13       14      15
Row5       16       17       18      19

In [4]:
#created a test file
df.to_csv('test1.csv')

In [5]:
#accessing the elements
#two ways: (A) .loc (B) .iloc

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Coumn4     3
Name: Row1, dtype: int32

In [6]:
#series has either one row or one column
type(df.loc['Row1'])

pandas.core.series.Series

In [7]:
#left row index and right column index
df.iloc[0:3,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9

In [8]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [9]:
## Take the elements from the Column2
df.iloc[:,1:]

      Column2  Column3  Coumn4
Row1        1        2       3
Row2        5        6       7
Row3        9       10      11
Row4       13       14      15
Row5       17       18      19

In [10]:
#convert Dataframes into array, it skips column an rom indexes
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [11]:
#to check null values
df.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of       Column1  Column2  Column3  Coumn4
Row1    False    False    False   False
Row2    False    False    False   False
Row3    False    False    False   False
Row4    False    False    False   False
Row5    False    False    False   False>

In [13]:
#find the no. of times an element as occured
df['Column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [15]:
#to find unique values in a column
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [19]:
#to view columns
df[['Column3','Coumn4']]

      Column3  Coumn4
Row1        2       3
Row2        6       7
Row3       10      11
Row4       14      15
Row5       18      19

In [ ]:
#new commits